IMPORT

In [3]:
import pandas as pd
from sqlalchemy import create_engine
import numpy as np

ENGINE

In [4]:
en = create_engine("mysql+pymysql://root:root@localhost/Veiculos")

BRANDS DF

In [5]:
df_b = pd.read_csv('brands.csv')

CREATE TABLE

In [6]:
df_b.to_sql(name='brands', if_exists='append', index=False,con=en)

194

FIPE DF

In [ ]:
df_f = pd.read_excel('fipe.xls')

TRAT DF

In [9]:
cols = ['codigoMarca','Marca','codigoTipoVeiculo']
trat_b = df_f[~df_f.Marca.isin(df_b.name)][cols].drop_duplicates()

In [11]:
trat_b = trat_b.rename(columns={'codigoMarca':'id_veiculo_marca','Marca':'name','codigoTipoVeiculo':'type'}).replace({1:0,2:1,3:2})

SEND TO SQL

In [13]:
trat_b.to_sql(name='brands', con=en, if_exists='append', index=False)

26

---
# MODELS

MODELS DF

In [15]:
df_m= pd.read_csv('models.csv')

CREATE TABLE

In [ ]:
df_m.to_sql(name='models', if_exists='append', index=False,con=en)

7698

TRAT DF

In [16]:
trat_m = df_f[~df_f.Modelo.isin(df_m.name)][['codigoModelo','Modelo','codigoMarca']].drop_duplicates()

In [17]:
trat_m = trat_m.rename(columns={'codigoModelo':'id_veiculo_modelo','Modelo':'name','codigoMarca':'fk_veiculo_marca'}).replace({1:0,2:1,3:2})

In [18]:
trat_m.insert(2,'status',1,True)

In [19]:
trat_m

,id_veiculo_modelo,name,status,fk_veiculo_marca
83,10883,MARRUÁ AM 200 Esc. 3.8 TDI Die.Aut. (E6),1,1
86,9352,MARRUÁ AM 200 Escolar 2.8 TDI Diesel,1,1
88,10884,MARRUÁ AM 200 Escolar 3.8 TDI Die. (E6),1,1
91,9353,MARRUÁ AM 200 Microbus 2.8 TDI Diesel,1,1
93,10864,MARRUÁ AM 250 3.8 CD TDI Die. Aut. (E6),1,1
...,...,...,...,...
46167,10545,VM 360 8X2 2p (diesel) (E6),1,116
46170,10649,VM 360 8X4 2p (diesel) (E6),1,116
46195,4572,Phanter Special Escolar 2p (diesel),1,144
46207,4573,Phanter Special Exec./Turismo 2p (die.),1,144
46219,4574,Phanter Special Urbano/SPTRANS 2p (die.),1,144